In [1]:
import mysql.connector

In [3]:
import mysql.connector
connection = mysql.connector.connect(host="localhost",
                                     user= "root",
                                     passwd="root")

print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001DB0A28A9D0>

In [4]:
cursorObject = connection.cursor()

In [5]:
cursorObject.execute("CREATE DATABASE e_commerce")

In [7]:
connection = mysql.connector.connect(host="localhost",
                                     user= "root",
                                     passwd="root",
                                     database = "e_commerce")
cursorObject = connection.cursor()
Customers = """Create TABLE supplier(
                SUPP_ID int primary key,SUPP_NAME Varchar(50),SUPP_CITY Varchar(50),SUPP_PHONE Varchar(10))"""
cursorObject.execute(Customers)

In [10]:
connection = mysql.connector.connect(host="localhost",
                                     user= "root",
                                     passwd="root",
                                     database = "e_commerce")
cursorObject = connection.cursor()
Customers = """CREATE TABLE customer(
                CUS_ID INT NOT NULL,
                CUS_NAME VARCHAR(20) DEFAULT NULL,
                CUS_PHONE VARCHAR(10),
                CUS_CITY VARCHAR(30),
                CUS_GENDER CHAR,
                PRIMARY KEY (CUS_ID))"""
cursorObject.execute(Customers)

In [11]:
connection = mysql.connector.connect(host="localhost",
                                     user= "root",
                                     passwd="root",
                                     database = "e_commerce")
cursorObject = connection.cursor()
Customers = """CREATE TABLE category(
                CAT_ID INT NOT NULL,
                CAT_NAME VARCHAR(20) DEFAULT NULL,
                PRIMARY KEY (CAT_ID))"""
cursorObject.execute(Customers)

In [13]:
connection = mysql.connector.connect(host="localhost",
                                     user= "root",
                                     passwd="root",
                                     database = "e_commerce")
cursorObject = connection.cursor()
Customers = """CREATE TABLE product (
    PRO_ID INT NOT NULL,
    PRO_NAME VARCHAR(20) DEFAULT NULL,
    PRO_DESC VARCHAR(60) DEFAULT NULL,
    CAT_ID INT NOT NULL,
    PRIMARY KEY (PRO_ID),
    FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID)
)"""
cursorObject.execute(Customers)

In [15]:
connection = mysql.connector.connect(host="localhost",
                                     user= "root",
                                     passwd="root",
                                     database = "e_commerce")
cursorObject = connection.cursor()
Customers = """CREATE TABLE product_details (
    PROD_ID INT NOT NULL,
    PRO_ID INT NOT NULL,
    SUPP_ID INT NOT NULL,
    PROD_PRICE INT NOT NULL,
    PRIMARY KEY (PROD_ID),
    FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID),
    FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID)
)"""
cursorObject.execute(Customers)

In [18]:
connection = mysql.connector.connect(host="localhost",
                                     user= "root",
                                     passwd="root",
                                     database = "e_commerce")
cursorObject = connection.cursor()
Customers = """CREATE TABLE `order` (
  ORD_ID INT NOT NULL, 
  ORD_AMOUNT INT NOT NULL, 
  ORD_DATE DATE, 
  CUS_ID INT NOT NULL, 
  PROD_ID INT NOT NULL,
  PRIMARY KEY (ORD_ID),
  FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),
  FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID)
)"""
cursorObject.execute(Customers)

In [19]:
connection = mysql.connector.connect(host="localhost",
                                     user= "root",
                                     passwd="root",
                                     database = "e_commerce")
cursorObject = connection.cursor()
Customers = """CREATE TABLE `rating` (
    RAT_ID INT NOT NULL,
    CUS_ID INT NOT NULL,
    SUPP_ID INT NOT NULL,
    RAT_RATSTARS INT NOT NULL,
    PRIMARY KEY (RAT_ID),
    FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),
    FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER (CUS_ID)
)"""
cursorObject.execute(Customers)

In [25]:
insert_query = "INSERT INTO supplier (SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES (%s, %s, %s, %s)"

values = [
    (1, "Rajesh Retails", "Delhi", "1234567890"),
    (2, "Appario Ltd.", "Mumbai", "258963147032"),
    (3, "Knome products", "Bangalore", "9785462315"),
    (4, "Bansal Retails", "Kochi", "8975463285"),
    (5, "Mittal Ltd.", "Lucknow", "7898456532")
]
cursorObject.executemany(insert_query,values)
connection.commit()

In [24]:
alter_query = "ALTER TABLE supplier MODIFY COLUMN SUPP_PHONE VARCHAR(15)"
cursorObject.execute(alter_query)

In [26]:
alter_query = "ALTER TABLE customer MODIFY COLUMN CUS_PHONE VARCHAR(15)"
cursorObject.execute(alter_query)

In [27]:
insert_query = "INSERT INTO customer (CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER) VALUES (%s, %s, %s, %s, %s)"

# Data to be inserted
values = [
    (1, "AAKASH", "9999999999", "DELHI", "M"),
    (2, "AMAN", "9785463215", "NOIDA", "M"),
    (3, "NEHA", "9999999998", "MUMBAI", "F"),
    (4, "MEGHA", "9994562399", "KOLKATA", "F"),
    (5, "PULKIT", "7895999999", "LUCKNOW", "M")
]
cursorObject.executemany(insert_query,values)
connection.commit()

In [28]:
insert_query = "INSERT INTO category (CAT_ID, CAT_NAME) VALUES (%s, %s)"
values = [(1, 'BOOKS'),
(2, 'GAMES'),
(3, 'GROCERIES'),
(4, 'ELECTRONICS'),
(5, 'CLOTHES')]
cursorObject.executemany(insert_query,values)
connection.commit()

In [29]:
insert_query = "INSERT INTO product (PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) VALUES (%s, %s, %s, %s)"
values = [
    (1, 'GTA V', 'DFJDJFDJFDJFDJFJF', 2),
    (2, 'TSHIRT', 'DFDFJDFJDKFD', 5),
    (3, 'ROG LAPTOP', 'DFNTTNTNTERND', 4),
    (4, 'OATS', 'REURENTBTOTH', 3),
    (5, 'HARRY POTTER', 'NBEMCTHTJTH', 1)
]
cursorObject.executemany(insert_query,values)
connection.commit()

In [31]:
insert_query = "INSERT INTO product_details (PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE) VALUES (%s, %s, %s, %s)"
values= [
    (1, 1, 2, 1500),
    (2, 3, 5, 30000),
    (3, 5, 1, 3000),
    (4, 2, 3, 2500),
    (5, 4, 1, 1000)
]
cursorObject.executemany(insert_query,values)
connection.commit()

In [35]:
insert_query = "INSERT INTO `order` (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES (%s, %s, %s, %s, %s)"
values = [
    (20, 1500, '2021-10-12', 3, 5),
    (25, 30500, '2021-09-16', 5, 2),
    (26, 2000, '2021-10-05', 1, 1),
    (30, 3500, '2021-08-16', 4, 3),
    (50, 2000, '2021-10-06', 2, 1)
]
cursorObject.executemany(insert_query,values)
connection.commit()

In [40]:
insert_query = "INSERT INTO rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES (%s, %s, %s, %s)"
values = [
    (1, 2, 2, 4),
    (2, 3, 4, 3),
    (3, 5, 1, 5),
    (4, 1, 3, 2),
    (5, 4, 5, 4)
]

InterfaceError: Failed executing the operation; Not all parameters were used in the SQL statement

In [49]:
Query4 = """
   SELECT `order`.*, product.pro_name 
FROM `order` 
JOIN product_details ON `order`.prod_id = product_details.prod_id 
JOIN product ON product_details.pro_id = product.pro_id 
WHERE `order`.cus_id = 2;
"""
cursorObject.execute(Query4)

results = cursorObject.fetchall()

for row in results:
    print(row)

(50, 2000, datetime.date(2021, 10, 6), 2, 1, 'GTA V')

In [25]:
Query5 = """
    SELECT s.*
FROM supplier s
JOIN product_details pd ON s.SUPP_ID = pd.SUPP_ID
GROUP BY s.SUPP_ID
HAVING COUNT(pd.PROD_ID) > 1;

"""
cursorObject.execute(Query5)
results = cursorObject.fetchall()

for row in results:
    print(row)

(1, 'Rajesh Retails', 'Delhi', '1234567890')

In [64]:
Query6 = """
SELECT category.*
FROM `order`
INNER JOIN product_details ON `order`.prod_id = product_details.prod_id
INNER JOIN product ON product.pro_id = product_details.pro_id
INNER JOIN category ON category.cat_id = product.cat_id
GROUP BY category.CAT_ID, category.CAT_NAME
HAVING MIN(`order`.ord_amount);
"""

cursorObject.execute(Query6)
output_df = pd.DataFrame(cursorObject.fetchall(), columns=['CAT_ID', 'CAT_NAME'])
output_df

   CAT_ID     CAT_NAME
0       3    GROCERIES
1       4  ELECTRONICS
2       2        GAMES
3       1        BOOKS

In [62]:
    connection.close()

In [63]:
connection = mysql.connector.connect(host="localhost",
                                     user= "root",
                                     passwd="root",
                                     database = "e_commerce")
cursorObject = connection.cursor()

In [60]:
import pandas as pd

In [66]:
Query7 = """
SELECT product.pro_id, product.pro_name
FROM product
INNER JOIN `order` AS ord ON ord.prod_id = product.pro_id
WHERE ord.ord_date > '2021-10-05';
"""

cursorObject.execute(Query7)
output_df = pd.DataFrame(cursorObject.fetchall(), columns=['PRO_ID', 'PRO_NAME'])
output_df

   PRO_ID      PRO_NAME
0       5  HARRY POTTER
1       1         GTA V

In [11]:
Query3 = """SELECT c.CUS_GENDER, COUNT(*) AS num_customers
FROM customer c
INNER JOIN `order` o ON c.cus_id = o.cus_id
WHERE o.ord_amount >= 3000
GROUP BY c.CUS_GENDER;"""
cursorObject.execute(Query3)
output_df = pd.DataFrame(cursorObject.fetchall(), columns=['CUS_GENDER','num_customers'])
output_df

  CUS_GENDER  num_customers
0          M              1
1          F              1

In [7]:
cursorObject = connection.cursor()

In [6]:
connection = mysql.connector.connect(host="localhost",
                                     user= "root",
                                     passwd="root",
                                     database = "e_commerce")
cursorObject = connection.cursor()

In [4]:
import mysql.connector

In [5]:
import pandas as pd

In [13]:
Query10 = """SELECT SUM(o.ord_amount) AS total_order_amount
FROM customer c
INNER JOIN `order` o ON c.cus_id = o.cus_id
WHERE c.CUS_GENDER = 'M';
"""
cursorObject.execute(Query10)
output_df = pd.DataFrame(cursorObject.fetchall(), columns=['total_order_amount'])
output_df

  total_order_amount
0              34500

In [14]:
Query9 = """SELECT CUS_NAME, CUS_GENDER
FROM customer
WHERE CUS_NAME LIKE 'A%' OR CUS_NAME LIKE '%A';
"""
cursorObject.execute(Query9)
output_df = pd.DataFrame(cursorObject.fetchall(), columns=['CUS_NAME','CUS_GENDER'])
output_df

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

In [17]:
Query8 = """SELECT s.SUPP_ID, s.SUPP_NAME, r.RAT_RATSTARS, c.CUS_NAME
FROM supplier s
JOIN rating r ON s.SUPP_ID = r.SUPP_ID
JOIN customer c ON r.CUS_ID = c.CUS_ID
ORDER BY r.RAT_RATSTARS DESC
LIMIT 3;

"""
cursorObject.execute(Query8)
output_df = pd.DataFrame(cursorObject.fetchall(), columns=['SUPP_ID','SUPP_NAME','RAT_RATSTARS','CUS_NAME'])
output_df

   SUPP_ID       SUPP_NAME  RAT_RATSTARS CUS_NAME
0        1  Rajesh Retails             5   PULKIT
1        2    Appario Ltd.             4     AMAN
2        5     Mittal Ltd.             4    MEGHA

In [24]:
Query11 = """SELECT c.CUS_ID, c.CUS_GENDER, c.CUS_CITY, c.CUS_NAME
FROM Customer c
LEFT JOIN `order` o ON c.CUS_ID = o.cus_id;
"""
cursorObject.execute(Query11)
output_df = pd.DataFrame(cursorObject.fetchall(), columns=['CUS_ID','CUS_GENDER','CUS_CITY','CUS_NAME'])
output_df

   CUS_ID CUS_GENDER CUS_CITY CUS_NAME
0       1          M    DELHI   AAKASH
1       2          M    NOIDA     AMAN
2       3          F   MUMBAI     NEHA
3       4          F  KOLKATA    MEGHA
4       5          M  LUCKNOW   PULKIT